In [7]:
##############
#K. David Roell CFPB 7/12/16
#Compiles a report of all quality and macro edit failures for HMDA LAR data
#
##############
import json
import os
import pandas as pd
import psycopg2

with open('edit_sql.json') as f:
    edit_sql = json.load(f)
    
#conn = psycopg2.connect("dbname=hmdamaster user=roellk") #connect and return connection
#cur = conn.cursor()#instantiate cursor object to use in SQL queries
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',

}

#connect_string = "dbname=%s user=%s host=%s password =%s" %(dbname, user, host, password) #set a string for connection to SQL
try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)


lar_tables = ['hmdalar2014', 'hmdalar2013']
#edit_list = [item for item in dir(SQL_text) if not item.startswith("__")]

i'm connected

In [8]:
def edit_text(table='hmdalar2014', edit_sql=edit_sql[0]['text'], additional_fields=[]):
    base_sql = """SELECT agency, COUNT(sequence) """
    table_sql = "\nFROM {table}\n".format(table=table) 
    group_sql = """ GROUP BY agency"""

    add_fields = ''
    for field in additional_fields:
        base_sql = base_sql + ',' + field
        group_sql = group_sql + ', '+ field
    return_sql = base_sql + table_sql + edit_sql + group_sql + ';'
    print(return_sql)
    return return_sql

In [ ]:
for edit in edit_sql:
    name, text = edit['name'], edit['text']
    try:
        cur.execute(edit_text(edit_sql=text))
        data_df = pd.DataFrame(cur.fetchall())
        col_names = [desc[0] for desc in cur.description]
        data_df.columns = col_names
        print(data_df)
    except:
        print('no dataz')

SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE loan_type != '1' AND purchaser IN  ('1','3') GROUP BY agency;
  agency  count
0      9    199
1      3    446
2      1    408
3      7   1579
4      2    158
5      5    156
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE amount not like '%NA%' AND income not like '%NA%' AND amount::int >= 1000 AND (amount::int / income::int) < 5 GROUP BY agency;
  agency  count
0      9  54243
1      3   4614
2      1   4514
3      7   9280
4      2   1667
5      5   1699
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE property_type = '1' AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%' AND income::INT >= 200 AND amount::INT >= 2000 GROUP BY agency;
  agency  count
0      9   9892
1      3    704
2      1    971
3      7    673
4      2    274
5      5    214
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE loan_type = '2' AND property_type in ('1', '2') AND amount::INT > 626 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      3    114
1      9   1178
2      7   3107
3      1    139
4      2     72
5      5     13
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE loan_type = '3' AND property_type IN ('1', '2') AND amount::INT >= 1050 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      9    192
1      3     48
2      7    487
3      1     57
4      2      7
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE purchaser IN ('1', '2', '3', '4') AND property_type IN ('1', '2') AND amount::INT > 1203 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      9     51
1      3      4
2      7     52
3      1      7
4      2      1
5      5      2
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE property_type = '3' AND amount::INT >= 100 AND amount::INT <= 10000 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      3  12200
1      9  16326
2      1   6668
3      7   2294
4      2   3245
5      5   1303
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE property_type = '2' AND amount::INT > 150 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      9   5118
1      3   2384
2      7  15224
3      1    988
4      2    479
5      5   1454
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE lien = '2' AND amount::INT > 250 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      9   2646
1      3   1459
2      1    542
3      7    330
4      2    365
5      5    502
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE lien = '3' AND amount::INT > 100 AND amount NOT LIKE '%NA%' GROUP BY agency;
  agency  count
0      9    546
1      3    203
2      7     11
3      1     98
4      2     41
5      5     84
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE loan_purpose = '1' AND property_type = '1' AND amount::INT <=10 AND amount NOT LIKE '%NA' GROUP BY agency;
  agency  count
0      9   8302
1      3   3980
2      1   4152
3      7  23214
4      2   2123
5      5   1253
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE action = '1' AND action_taken_date == application_received_date GROUP BY agency;
no dataz
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE action IN ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' GROUP BY agency;
no dataz
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE income::INT > 3000 AND income NOT LIKE '%NA%' GROUP BY agency;
no dataz
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE action = '1' AND (amount::INT / income::INT) >= 5 AND income::INT <= 9 AND income NOT LIKE '%NA%' AND amount NOT LIKE '%NA%'  GROUP BY agency;
no dataz
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND property_type IN ('1', '2') AND income LIKE '%NA'  GROUP BY agency;
no dataz
SELECT agency, COUNT(sequence)
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' AND income NOT LIKE '%NA%' GROUP BY agency;
no dataz

In [83]:

cur.execute(edit_text(edit_sql=text))
data_df = pd.DataFrame(cur.fetchall())
col_names = [desc[0] for desc in cur.description]
data_df.columns = col_names
data_df

  agency  count
0      3     25
1      9      2
2      1     83
3      7      8
4      2      8
5      5    115